In [2]:
!pip install pandas sqlalchemy sqlacodegen

Collecting pandas
  Using cached pandas-1.3.5-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.5 MB)
Collecting sqlalchemy
  Using cached SQLAlchemy-1.4.29-cp38-cp38-manylinux_2_5_x86_64.manylinux1_x86_64.manylinux_2_17_x86_64.manylinux2014_x86_64.whl (1.6 MB)
Collecting sqlacodegen
  Downloading sqlacodegen-2.3.0-py2.py3-none-any.whl (13 kB)
Collecting numpy>=1.17.3
  Using cached numpy-1.21.5-cp38-cp38-manylinux_2_12_x86_64.manylinux2010_x86_64.whl (15.7 MB)
Collecting pytz>=2017.3
  Using cached pytz-2021.3-py2.py3-none-any.whl (503 kB)
Requirement already satisfied: python-dateutil>=2.7.3 in ./venv/lib/python3.8/site-packages (from pandas) (2.8.2)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (156 kB)
     |████████████████████████████████| 156 kB 1.8 MB/s
Collecting inflect>=0.2.0
  Downloading inflect-5.3.0-py3-none-any.whl (32 kB)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: greenlet, sqlalchemy, pytz, numpy, inflect, sqlacodegen, pandas
Successfully installed greenlet-1.1.2 inflect-5.3.0 numpy-1.21.5 pandas-1.3.5 pytz-2021.3 sqlacodegen-2.3.0 sqlalchemy-1.4.29

In [3]:
import pickle
import pandas as pd

In [5]:
data = [{'name':'Abdel'}]
with open('users.pkl', 'wb') as f:
    pickle.dump(data, f)

In [6]:
data_from_pkl = pickle.load(open('users.pkl', 'rb'))
print(data_from_pkl)

[{'name': 'Abdel'}]

In [8]:
df = pd.DataFrame(data_from_pkl)
df.head()

    name
0  Abdel

In [9]:
df.to_pickle('df_pkl')
df.dtypes

name    object
dtype: object

In [11]:
df2= pd.read_pickle('df_pkl')
df2.head()

    name
0  Abdel

In [12]:
df.to_csv('my_df.csv', index=False)

### SQLAlchemy

SqlAlchemy and Django have a similar ORM

In [17]:
from dataclasses import dataclass

@dataclass
class Movie:
    name:str = 'Name'
    genre:str = 'Genre'
    year:int = None

In [30]:
movie_obj = Movie('Spider-Man', 'Superhero Film', 2002)
movie_obj.name
movie_obj.year

2002

In [31]:
data = [{
    "name": "Interstellar",
    "genre": "Sci-Fi"
},
{
    "name": "The Martian",
    "genre": "Sci-Fi"
},
{
    "name": "Arrival",
    "genre": "Sci-Fi"
}
]

In [33]:
df = pd.DataFrame(data)
df.head()

           name   genre
0  Interstellar  Sci-Fi
1   The Martian  Sci-Fi
2       Arrival  Sci-Fi

In [99]:
import sqlalchemy
from sqlalchemy import create_engine, Column, String, Integer
from sqlalchemy.orm import sessionmaker

In [100]:
engine = create_engine('sqlite:///app.db')

In [101]:
Session = sessionmaker(bind=engine)
session = Session()

In [102]:
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()

In [103]:
class Movie(Base): #table
    __tablename__='movies'
    
    id = Column(Integer, primary_key=True)
    name = Column(String)
    genre = Column(String)
    desc = Column(String)
    year = Column(Integer, nullable=True)
    
    #representation
    def __repr__(self):
        return f'<Movie name={self.name}>'

In [104]:
Base.metadata.create_all(engine)#Add table to database

In [105]:
movie = Movie(name= 'Avatart', genre='Sci-Fi')

In [106]:
session.add(movie)
session.commit()

In [107]:
print(movie.id)

6

### CRUD in SQLAlchemy
Create/Retrieve/Update/Delete

In [108]:
Session = sessionmaker(bind=engine)
session = Session()

In [109]:
movie = Movie(name='Iron Man')
session.add(movie)
session.commit()

In [110]:
movie_ret = session.query(Movie).all()
movie_ret

[<Movie name=Avatart>,
 <Movie name=Iron Man>,
 <Movie name=Iron Man>,
 <Movie name=Avatart>,
 <Movie name=Iron Man>,
 <Movie name=Avatart>,
 <Movie name=Iron Man>]

In [113]:
movie_ret = session.query(Movie).filter_by(name="Iron Man").all()
movie_ret

[<Movie name=Iron Man>,
 <Movie name=Iron Man>,
 <Movie name=Iron Man>,
 <Movie name=Iron Man>]

In [117]:
search = input('Name of movie') or 'Name'
movie_ret = session.query(Movie).filter_by(name=search).all()
print(movie_ret)

Name of movieAvatart
[<Movie name=Avatart>, <Movie name=Avatart>, <Movie name=Avatart>]

In [120]:
movie_ret = session.query(Movie).get(2)
session.delete(movie_ret)
session.commit()
session.flush()

In [121]:
session.query(Movie).all()

[<Movie name=Avatart>,
 <Movie name=Iron Man>,
 <Movie name=Avatart>,
 <Movie name=Iron Man>,
 <Movie name=Avatart>,
 <Movie name=Iron Man>]

In [128]:
import sqlite3

con = sqlite3.connect('app.db')
# con2 = sqlite3.connect('sqlite:///app.db')

df = pd.read_sql_query('select * from movies', con)
df.head()

   id      name   genre  desc  year
0   1   Avatart  Sci-Fi  None  None
1   3  Iron Man    None  None  None
2   4   Avatart  Sci-Fi  None  None
3   5  Iron Man    None  None  None
4   6   Avatart  Sci-Fi  None  None